src_ext/DataProcessors/УЗ_ПанельУченика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_ПанельУченика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/DataProcessors/УЗ_ПанельУченика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Действия панели ученика с уроками группы: «Продлить группу», «Добавить в группу», «Удалить из группы». Логика
// здесь, а не в модуле формы, — её проверяет COM-тест тест_панель_ученика.py. Перевод ученика в другую группу —
// документ «Перевод ученика» (В29: состав групп меняется только им, с датой и перестроением уроков-планов).
//
// Урок группы на дату ищется среди всех непомеченных на удаление уроков — и проведённых, и записанных планом
// (раньше только среди проведённых: запланированный урок не находился, и рядом создавался второй).
// В10 (решение владельца 28.09.2026): урок, который ещё не начался, только записывается (план), прошедший —
// проводится (УЗ_Общий.ЗаписатьУрок). Результат строки — по факту записи: «Проведено» только у проведённого урока.

// Записать ученика в уроки группы на даты: урок группы на дату есть — ученик добавляется в него, нет — урок
// создаётся по группе (педагог, предмет, помещение, время дня по расписанию).
//
// Параметры:
//   Ученик - СправочникСсылка.УЗ_ФизЛица
//   ГруппаОбучения - СправочникСсылка.УЗ_ГруппыОбучения
//   Даты - Массив, СписокЗначений - даты уроков (с временем начала)
//   Скидка - СправочникСсылка.УЗ_Скидки, Неопределено - скидка ученика в новых строках
//   Организация - СправочникСсылка.Организации, Неопределено - организация новых уроков (панель задаёт свою;
//                 не задана — из настроек)
//
// Возвращаемое значение:
//   Массив из Структура - Успех, Описание, ДопОписание, Урок — строки итога для таблицы «Результат».
//
Функция ЗаписатьУченикаВГруппу(Ученик, ГруппаОбучения, Даты, Скидка = Неопределено, Организация = Неопределено) Экспорт

	Итог = Новый Массив;
	Тариф = ТарифУченикаВГруппе(Ученик, ГруппаОбучения);
	Для Каждого ДатаУрока Из МассивДат(Даты) Цикл
		Уроки = УрокиГруппыНаДату(ГруппаОбучения, ДатаУрока);
		Если Уроки.Количество() > 1 Тогда
			Итог.Добавить(
				СтрокаИтога(Ложь, СтрШаблон(НСтр("ru = 'У группы %1 на %2 несколько уроков (%3) — ученик не добавлен'"),
				ГруппаОбучения, Формат(ДатаУрока, "ДЛФ=DT"), Уроки.Количество()), НСтр("ru = 'Отказ'")));
			Продолжить;
		КонецЕсли;
		Если Уроки.Количество() = 1 Тогда
			Урок = Уроки[0].ПолучитьОбъект();
			Если Урок.Ученики.Найти(Ученик, "Ученик") <> Неопределено Тогда
				ЭлементИтога = СтрокаИтога(Ложь, СтрШаблон(НСтр("ru = 'Уже есть в уроке: %1'"), Ученик),
					НСтр("ru = 'Отказ'"), Урок.Ссылка);
				ЭлементИтога.УжеЕсть = Истина;
				Итог.Добавить(ЭлементИтога);
				Продолжить;
			КонецЕсли;
			//проведённый урок — перепровести, записанный планом — оставить планом
			Провести = Урок.Проведен;
			Описание = СтрШаблон(НСтр("ru = 'Добавлен ученик: %1'"), Ученик);
		Иначе
			Урок = НовыйУрокГруппы(ГруппаОбучения, ДатаУрока, Организация);
			Провести = Истина;
			Описание = Строка(Ученик);
		КонецЕсли;
		СтрокаУченика = Урок.Ученики.Добавить();
		СтрокаУченика.Ученик = Ученик;
		СтрокаУченика.СписатьОплату = Истина;
		СтрокаУченика.Тариф = Тариф;
		Если ЗначениеЗаполнено(Скидка) Тогда
			СтрокаУченика.Скидка = Скидка;
			Описание = Описание + "; " + НСтр("ru = 'скидка'") + ": " + Скидка;
		КонецЕсли;
		//абонемент на дату этого урока — как в форме урока и помощнике (Р-2: прежде панель ставила только тариф,
		//и ученик с абонементом платил по тарифу, а заморозку урок не видел)
		СтрокиУченика = Новый Массив;
		СтрокиУченика.Добавить(СтрокаУченика);
		Для Каждого Предупреждение Из Справочники.УЗ_Абонемент.ПодставитьАбонементы(Урок, СтрокиУченика) Цикл
			Описание = Описание + "; " + Предупреждение;
		КонецЦикла;
		Если ЗначениеЗаполнено(СтрокаУченика.Абонемент) Тогда
			Описание = Описание + "; " + НСтр("ru = 'абонемент'") + ": " + СтрокаУченика.Абонемент;
		КонецЕсли;
		Занято = ?(Урок.ЭтоНовый(), Документы.УЗ_Урок.ТекстПересечения(Урок), "");
		Если Занято <> "" Тогда
			//A16-05: новый урок не ставится поверх урока того же педагога или в занятое помещение
			Итог.Добавить(СтрокаИтога(Ложь, СтрШаблон(НСтр("ru = 'Отказ: %1 на %2: %3'"), Описание,
				Формат(ДатаУрока, "ДЛФ=DT"), Занято), НСтр("ru = 'Не записан'")));
			Продолжить;
		КонецЕсли;
		Итог.Добавить(ЗаписатьИРезультат(Урок, Провести, Описание, ДатаУрока));
	КонецЦикла;
	Возврат Итог;

КонецФункции

// Убрать ученика из записанных планом уроков группы на даты; проведённые не меняются (строка итога с отказом).
// Урок, где ученик был один, помечается на удаление.
//
// Возвращаемое значение:
//   Массив из Структура - как у ЗаписатьУченикаВГруппу.
//
Функция УдалитьУченикаИзГруппы(Ученик, ГруппаОбучения, Даты) Экспорт

	Итог = Новый Массив;
	Для Каждого ДатаУрока Из МассивДат(Даты) Цикл
		Уроки = УрокиГруппыНаДату(ГруппаОбучения, ДатаУрока);
		Если Уроки.Количество() = 0 Тогда
			Итог.Добавить(СтрокаИтога(Ложь, СтрШаблон(НСтр("ru = 'У группы %1 на %2 урока нет'"), ГруппаОбучения,
				Формат(ДатаУрока, "ДЛФ=D")), НСтр("ru = 'Урок не найден'")));
		КонецЕсли;
		Для Каждого СсылкаУрока Из Уроки Цикл
			Урок = СсылкаУрока.ПолучитьОбъект();
			//все строки ученика (у одного ученика в уроке бывает несколько строк — разные абонементы, Codex N04)
			СтрокиУченика = Урок.Ученики.НайтиСтроки(Новый Структура("Ученик", Ученик));
			Если СтрокиУченика.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			//A16-06: проведённый урок — факт оказанной услуги, панель его не переписывает
			Если Урок.Проведен Тогда
				Итог.Добавить(СтрокаИтога(Ложь, СтрШаблон(НСтр(
					"ru = 'Урок на %1 проведён — ученик в нём остаётся; исправьте сам урок, если ученика не было'"),
					Формат(Урок.Дата, "ДЛФ=DT")), НСтр("ru = 'Проведён, не изменён'"), Урок.Ссылка));
				Продолжить;
			КонецЕсли;
			Если Урок.Ученики.Количество() > СтрокиУченика.Количество() Тогда
				Для Каждого СтрокаУченика Из СтрокиУченика Цикл
					Урок.Ученики.Удалить(СтрокаУченика);
				КонецЦикла;
				Итог.Добавить(ЗаписатьИРезультат(Урок, Урок.Проведен,
					СтрШаблон(НСтр("ru = 'Удалён ученик: %1'"), Ученик), ДатаУрока));
			Иначе
				Попытка
					Урок.УстановитьПометкуУдаления(Истина);
					Итог.Добавить(СтрокаИтога(Истина, НСтр("ru = 'Урок без учеников помечен на удаление'"),
						НСтр("ru = 'Пометка удаления'"), Урок.Ссылка));
				Исключение
					Итог.Добавить(СтрокаИтога(Ложь, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
						НСтр("ru = 'Не помечен на удаление'"), Урок.Ссылка));
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Итог;

КонецФункции

// «Переместить деньги» панели: деньги ученика с предмета на предмет в организации панели (C03, В12: деньги
// учеников раздельно по организациям; прежде перемещение создавалось без организации — в пустой).
//
// Возвращаемое значение:
//   Структура - Успех, Описание, ДопОписание, Урок (здесь — проведённое перемещение или пустая ссылка).
//
Функция ПереместитьДеньгиУченика(Ученик, Организация, ИзПредмета, ВПредмет, Сумма) Экспорт

	Описание = СтрШаблон(НСтр("ru = '%1 с предмета обучения: %2 на предмет: %3'"), Ученик, ИзПредмета, ВПредмет);
	Если НЕ ЗначениеЗаполнено(ИзПредмета) Или НЕ ЗначениеЗаполнено(ВПредмет) Или ИзПредмета = ВПредмет
		Или Сумма <= 0 Тогда
		Возврат СтрокаИтога(Ложь, НСтр("ru = 'Укажите разные «Из предмета» и «В предмет» и сумму больше нуля'"),
			НСтр("ru = 'Отказ'"));
	КонецЕсли;

	Перемещение = Документы.УЗ_ПеремещениеДенег.СоздатьДокумент();
	Перемещение.Дата                           = ТекущаяДатаСеанса();
	Перемещение.Клиент                         = Ученик;
	Перемещение.Организация                    = Организация;
	Перемещение.ПредметОбученияОтправитель     = ИзПредмета;
	Перемещение.ПредметОбученияПолучатель      = ВПредмет;
	Перемещение.СделатьДвиженияПоВзаиморасчетам = Истина;
	Перемещение.Сумма                          = Сумма;
	Попытка
		Перемещение.Записать(РежимЗаписиДокумента.Проведение);
		Возврат СтрокаИтога(Истина, Описание, НСтр("ru = 'Проведено!'"), Перемещение.Ссылка);
	Исключение
		//причина отказа — в сообщениях проведения, иначе — текст ошибки
		Причины = Новый Массив;
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Причины.Добавить(Сообщение.Текст);
		КонецЦикла;
		Если Причины.Количество() = 0 Тогда
			Причины.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		Возврат СтрокаИтога(Ложь, НСтр("ru = 'Отказ! '") + Описание + ": " + СтрСоединить(Причины, "; "),
			НСтр("ru = 'Не проведен!'"), Перемещение.Ссылка);
	КонецПопытки;

КонецФункции

// Даты уроков группы с ДатаНач по ДатаКон по расписанию группы (отмеченные дни недели, время начала дня).
// День недели — по ДеньНедели(), а не по строке Формат(…, "ДФ=ддд") (она зависит от языка).
//
// Возвращаемое значение:
//   СписокЗначений из Дата
//
Функция ДатыУроковГруппы(ГруппаОбучения, ДатаНач, ДатаКон) Экспорт

	СписокДат = Новый СписокЗначений;
	Если Не ЗначениеЗаполнено(ГруппаОбучения) Или Не ЗначениеЗаполнено(ДатаНач) Или Не ЗначениеЗаполнено(ДатаКон) Тогда
		Возврат СписокДат;
	КонецЕсли;
	День = НачалоДня(ДатаНач);
	Пока День <= ДатаКон Цикл
		Если ГруппаЗанимаетсяВДень(ГруппаОбучения, День) Тогда
			СписокДат.Добавить(НачалоУрокаГруппы(ГруппаОбучения, День));
		КонецЕсли;
		День = День + 86400;
	КонецЦикла;
	Возврат СписокДат;

КонецФункции

// Начало урока группы в день: время дня по расписанию группы, без него — общее «Время» группы
// (Документы.УЗ_Урок.РасписаниеГруппыНаДень, В21; день вне расписания — тем же правилом).
Функция НачалоУрокаГруппы(ГруппаОбучения, День) Экспорт

	Расписание = Документы.УЗ_Урок.РасписаниеГруппыНаДень(ГруппаОбучения, День);
	Если Расписание <> Неопределено Тогда
		Возврат Расписание.Начало;
	КонецЕсли;
	Время = ГруппаОбучения[ПрефиксДня(День) + "Время"];
	Если Не ЗначениеЗаполнено(Время) Тогда
		Время = ГруппаОбучения.Время;
	КонецЕсли;
	Возврат НачалоДня(День) + (Время - НачалоДня(Время));

КонецФункции

// Колонка «Осталось уроков» панели: по действующему абонементу предмета группы на сегодня — остаток тем же текстом,
// что в карточке абонемента, форме урока и помощнике (Справочники.УЗ_Абонемент.ТекстОстатка; прежде панель
// суммировала все абонементы по исходной дате окончания — Р-5, З-8); приостановленный — «приостановлен до …»,
// исчерпанный — «исчерпан»; без абонемента — сколько уроков покрывает остаток денег по цене единицы тарифа строки
// ученика (В20: тариф ученика → тариф группы, Документы.УЗ_Урок.ТарифСтрокиУченика; цена единицы — та же функция, что
// карточка ученика, ЦенаЕдиницыТарифа: часы нормализуются до минут) — «≈7», «≈3,5 ч». R12 ревью 28.09: прежде — тариф
// группы и своё деление (личный 500 при групповом 1 000 давал ≈2 вместо ≈4).
//
// Возвращаемое значение:
//   Строка
//
Функция ОсталосьУроковТекстом(Ученик, ГруппаОбучения, ОстатокДенег, Организация = Неопределено) Экспорт

	Сегодня = ТекущаяДатаСеанса();
	Подбор = Справочники.УЗ_Абонемент.ПодобратьАбонемент(Ученик, ГруппаОбучения.ПредметОбучения, Сегодня, Организация);
	Если ЗначениеЗаполнено(Подбор.Абонемент) Тогда
		Возврат Справочники.УЗ_Абонемент.ТекстОстатка(Подбор.Абонемент);
	ИначеЕсли ЗначениеЗаполнено(Подбор.Приостановленный) Тогда
		Состояние = Справочники.УЗ_Абонемент.СостояниеАбонемента(Подбор.Приостановленный, Сегодня);
		Возврат ?(ЗначениеЗаполнено(Состояние.ДатаВозобновления),
			НСтр("ru = 'приостановлен до '") + Формат(Состояние.ДатаВозобновления, "ДФ=dd.MM.yyyy"),
			НСтр("ru = 'приостановлен'")) + " (" + Справочники.УЗ_Абонемент.ТекстОстатка(Подбор.Приостановленный) + ")";
	ИначеЕсли ЗначениеЗаполнено(Подбор.Исчерпанный) Тогда
		Возврат Справочники.УЗ_Абонемент.ТекстОстатка(Подбор.Исчерпанный);
	КонецЕсли;

	//без абонемента — по деньгам и цене единицы тарифа строки ученика (В20)
	Если ОстатокДенег <= 0 Тогда
		Возврат "0";
	КонецЕсли;
	Тариф = Документы.УЗ_Урок.ТарифСтрокиУченика(Ученик, ГруппаОбучения);
	ЦенаЕдиницы = ?(ЗначениеЗаполнено(Тариф), Документы.УЗ_Урок.ЦенаЕдиницыТарифа(Тариф, Сегодня), Неопределено);
	Если ЦенаЕдиницы = Неопределено Тогда
		Возврат "";
	ИначеЕсли ЦенаЕдиницы.Единица = "ур." Тогда
		Возврат "≈" + Формат(Цел(ОстатокДенег / ЦенаЕдиницы.Цена), "ЧН=0; ЧГ=");
	КонецЕсли;
	Возврат "≈" + Формат(ОстатокДенег / ЦенаЕдиницы.Цена, "ЧДЦ=1; ЧН=0; ЧГ=") + " ч";

КонецФункции

//Сводка панели ученика (визуальный аудит №9): что с деньгами, абонементами и ближайшим уроком — одним взглядом.
//Возврат: Структура
//  Остатки — Массив Структура(Предмет, Остаток): ненулевые остатки денег ученика по предметам в организации
//            (пустая — во всех): плюс — переплата (аванс), минус — долг;
//  Абонементы — Массив Структура(Абонемент, Название, Текст, Исчерпан, Приостановлен): активированные абонементы,
//            действующие сегодня (включая приостановленные и исчерпанные — о них тоже надо сказать);
//  БлижайшийУрок — Структура(Урок, Дата, Предмет) или Неопределено.
Функция СводкаУченика(Ученик, Организация = Неопределено) Экспорт

	Сводка = Новый Структура("Остатки, Абонементы, БлижайшийУрок", Новый Массив, Новый Массив, Неопределено);
	Если Не ЗначениеЗаполнено(Ученик) Тогда
		Возврат Сводка;
	КонецЕсли;
	Сегодня = ТекущаяДатаСеанса();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.ПредметОбучения КАК ПредметОбучения,
	|	ПРЕДСТАВЛЕНИЕ(Остатки.ПредметОбучения) КАК Предмет,
	|	СУММА(Остатки.СуммаОстаток) КАК Остаток
	|ИЗ
	|	РегистрНакопления.УЗ_СписанияСуммЗаУроки.Остатки(
	|			,
	|			Клиент = &Клиент
	|				И (&ЛюбаяОрганизация
	|					ИЛИ Организация = &Организация)) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ПредметОбучения
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.СуммаОстаток) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.ПредметОбучения.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Абонементы.Ссылка КАК Абонемент,
	|	ПРЕДСТАВЛЕНИЕ(Абонементы.ПредметОбучения) КАК Предмет
	|ИЗ
	|	Справочник.УЗ_Абонемент КАК Абонементы
	|ГДЕ
	|	Абонементы.ФизЛицо = &Клиент
	|	И Абонементы.Активный
	|	И Абонементы.ДатаАктивации <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ Абонементы.ПометкаУдаления
	|	И Абонементы.ДатаНачала <= &Сегодня
	|	И (&ЛюбаяОрганизация
	|			ИЛИ Абонементы.Организация = &Организация
	|			ИЛИ Абонементы.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Абонементы.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УченикиУрока.Ссылка КАК Урок,
	|	УченикиУрока.Ссылка.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(УченикиУрока.Ссылка.ПредметОбучения) КАК Предмет
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УченикиУрока
	|ГДЕ
	|	УченикиУрока.Ученик = &Клиент
	|	И УченикиУрока.Ссылка.Дата >= &Сейчас
	|	И НЕ УченикиУрока.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Клиент", Ученик);
	Запрос.УстановитьПараметр("ЛюбаяОрганизация", Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сегодня", КонецДня(Сегодня));
	Запрос.УстановитьПараметр("Сейчас", Сегодня);
	Результаты = Запрос.ВыполнитьПакет();

	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Сводка.Остатки.Добавить(Новый Структура("Предмет, Остаток",
			?(ЗначениеЗаполнено(Выборка.ПредметОбучения), Выборка.Предмет, НСтр("ru = 'Без предмета'")),
				Выборка.Остаток));
	КонецЦикла;

	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Абонемент = Выборка.Абонемент;
		Приостановлен = Справочники.УЗ_Абонемент.ПриостановленНаДату(Абонемент, Сегодня);
		Если Не Приостановлен И Справочники.УЗ_Абонемент.ОшибкаДействия(Абонемент, Сегодня) <> "" Тогда
			Продолжить;     //срок кончился или ещё не начался
		КонецЕсли;
		Остаток = Справочники.УЗ_Абонемент.ОстатокАбонемента(Абонемент);
		Текст = ТекстОстаткаАбонементаСводки(Остаток);
		Если Приостановлен Тогда
			Текст = Текст + НСтр("ru = ' (приостановлен)'");
		КонецЕсли;
		Сводка.Абонементы.Добавить(Новый Структура("Абонемент, Название, Текст, Исчерпан, Приостановлен",
			Абонемент, ?(ПустаяСтрока(Выборка.Предмет), Строка(Абонемент), Выборка.Предмет), Текст, Остаток.Исчерпан,
			Приостановлен));
	КонецЦикла;

	//исчерпанный абонемент не показываем, если по тому же предмету есть действующий с занятиями
	Действующие = Новый Соответствие;
	Для Каждого Абонемент Из Сводка.Абонементы Цикл
		Если Не Абонемент.Исчерпан Тогда
			Действующие.Вставить(Абонемент.Название, Истина);
		КонецЕсли;
	КонецЦикла;
	Для Поз = -Сводка.Абонементы.ВГраница() По 0 Цикл
		Абонемент = Сводка.Абонементы[-Поз];
		Если Абонемент.Исчерпан И Действующие[Абонемент.Название] = Истина Тогда
			Сводка.Абонементы.Удалить(-Поз);
		КонецЕсли;
	КонецЦикла;

	Выборка = Результаты[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Сводка.БлижайшийУрок = Новый Структура("Урок, Дата, Предмет", Выборка.Урок, Выборка.Дата, Выборка.Предмет);
	КонецЕсли;

	Возврат Сводка;

КонецФункции

//Остаток абонемента для сводки: «Осталось уроков 3 из 8», по часам — «Осталось 1:30 из 8:00» (ч:мм),
//исчерпанный — «Исчерпан: 8 из 8», без ограничения — «Без ограничения занятий».
//  Остаток — Структура из Справочники.УЗ_Абонемент.ОстатокАбонемента.
Функция ТекстОстаткаАбонементаСводки(Остаток) Экспорт

	Если Не Остаток.Ограничен Тогда
		Возврат НСтр("ru = 'Без ограничения занятий'");
	ИначеЕсли Остаток.ПоЧасам Тогда
		Всего = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Остаток.Всего);
		Если Остаток.Исчерпан Тогда
			Возврат СтрШаблон(НСтр("ru = 'Исчерпан: %1 из %2'"),
				УЗ_ОбщийКлиентСервер.ЧасыМинуты(Остаток.Израсходовано), Всего);
		КонецЕсли;
		Возврат СтрШаблон(НСтр("ru = 'Осталось %1 из %2'"),
			УЗ_ОбщийКлиентСервер.ЧасыМинуты(Остаток.ОсталосьСекунд / 3600), Всего);
	ИначеЕсли Остаток.Исчерпан Тогда
		Возврат СтрШаблон(НСтр("ru = 'Исчерпан: %1 из %2'"), Формат(Остаток.Израсходовано, "ЧН=0; ЧГ="),
			Формат(Остаток.Всего, "ЧН=0; ЧГ="));
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'Осталось уроков %1 из %2'"), Формат(Остаток.Осталось, "ЧН=0; ЧГ="),
		Формат(Остаток.Всего, "ЧН=0; ЧГ="));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрефиксДня(День)
	Возврат СтрРазделить("ПН,ВТ,СР,ЧТ,ПТ,СБ,ВС", ",")[ДеньНедели(День) - 1];
КонецФункции

Функция ГруппаЗанимаетсяВДень(ГруппаОбучения, День)
	Возврат ГруппаОбучения[ПрефиксДня(День)] = Истина;
КонецФункции

//Длительность урока группы в день, часов (В21): по расписанию дня, иначе «Продолжительность» —
//Документы.УЗ_Урок.РасписаниеГруппыНаДень, одна функция с формой урока и помощником.
Функция ЧасовУрокаГруппы(ГруппаОбучения, День)

	Расписание = Документы.УЗ_Урок.РасписаниеГруппыНаДень(ГруппаОбучения, День);
	Если Расписание <> Неопределено Тогда
		Возврат Расписание.КоличествоЧасов;
	КонецЕсли;
	Возврат (ГруппаОбучения.Продолжительность - НачалоДня(ГруппаОбучения.Продолжительность)) / 3600;

КонецФункции

Функция МассивДат(Даты)

	Итог = Новый Массив;
	Если ТипЗнч(Даты) = Тип("СписокЗначений") Тогда
		Для Каждого Элемент Из Даты Цикл
			Итог.Добавить(Элемент.Значение);
		КонецЦикла;
	ИначеЕсли Даты <> Неопределено Тогда
		Для Каждого ДатаУрока Из Даты Цикл
			Итог.Добавить(ДатаУрока);
		КонецЦикла;
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Все непомеченные на удаление уроки группы на дату — и проведённые, и записанные планом.
//Уроки группы за день, а не по времени расписания: урок, перенесённый на другое время (в т. ч. перетаскиванием
//в календаре), находится — панель не создаёт дубль (облачный аудит A16-01).
Функция УрокиГруппыНаДату(ГруппаОбучения, ДатаУрока)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Урок.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И Урок.ГруппаОбучения = &ГруппаОбучения
	|	И НЕ Урок.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Урок.Проведен УБЫВ";
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ДатаУрока));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ДатаУрока));
	Запрос.УстановитьПараметр("ГруппаОбучения", ГруппаОбучения);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

//Тариф ученика в группе (В20): тариф ученика, иначе тариф группы (Документы.УЗ_Урок.ТарифНовойСтроки), иначе —
//из последнего урока ученика в этой группе.
Функция ТарифУченикаВГруппе(Ученик, ГруппаОбучения)

	Тариф = Документы.УЗ_Урок.ТарифНовойСтроки(Ученик, ГруппаОбучения);
	Если ЗначениеЗаполнено(Тариф) Тогда
		Возврат Тариф;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УрокУченики.Тариф КАК Тариф
	|ИЗ
	|	Документ.УЗ_Урок.Ученики КАК УрокУченики
	|ГДЕ
	|	УрокУченики.Ученик = &Ученик
	|	И УрокУченики.Ссылка.ГруппаОбучения = &ГруппаОбучения
	|	И НЕ УрокУченики.Ссылка.ПометкаУдаления
	|	И УрокУченики.Тариф <> ЗНАЧЕНИЕ(Справочник.УЗ_Тарифы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УрокУченики.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Ученик", Ученик);
	Запрос.УстановитьПараметр("ГруппаОбучения", ГруппаОбучения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Тариф;
	КонецЕсли;
	Возврат Справочники.УЗ_Тарифы.ПустаяСсылка();

КонецФункции

//Новый урок группы: педагог, предмет, помещение, часы по расписанию; ставка педагога — общей функцией урока
//(B07), организация — панели (C03), не задана — из настроек.
Функция НовыйУрокГруппы(ГруппаОбучения, ДатаУрока, Организация = Неопределено)

	Урок = Документы.УЗ_Урок.СоздатьДокумент();
	Урок.Дата = ДатаУрока;
	Урок.ГруппаОбучения = ГруппаОбучения;
	Урок.КоличествоЧасов = ЧасовУрокаГруппы(ГруппаОбучения, ДатаУрока);
	Урок.ПредметОбучения = ГруппаОбучения.ПредметОбучения;
	Урок.Педагог = ГруппаОбучения.Педагог;
	Урок.Помещение = ГруппаОбучения.Помещение;
	Документы.УЗ_Урок.ЗаполнитьСтавкуПедагога(Урок);
	Если ЗначениеЗаполнено(Организация) Тогда
		Урок.Организация = Организация;
	Иначе
		ЗаполнитьЗначенияСвойств(Урок, РегистрыСведений.УЗ_Настройки.Настройки(), "Организация");
	КонецЕсли;
	Возврат Урок;

КонецФункции

Функция ЗаписатьИРезультат(Урок, Провести, Описание, ДатаУрока)

	Записан = УЗ_Общий.ЗаписатьУрок(Урок, Провести);
	Если Не Записан.Успех Тогда
		Возврат СтрокаИтога(Ложь, СтрШаблон(НСтр("ru = 'Отказ: %1 на %2: %3'"), Описание, Формат(ДатаУрока, "ДЛФ=DT"),
			Записан.Текст), НСтр("ru = 'Не записан'"), Урок.Ссылка);
	КонецЕсли;
	Если Урок.Проведен Тогда
		ДопОписание = НСтр("ru = 'Проведено'");
	Иначе
		ДопОписание = НСтр("ru = 'Записан без проведения (план)'");
	КонецЕсли;
	Возврат СтрокаИтога(Истина, Описание, ДопОписание, Урок.Ссылка);

КонецФункции

Функция СтрокаИтога(Успех, Описание, ДопОписание, Урок = Неопределено)
	//УжеЕсть — ученик уже в уроке (строка итога «Уже есть в уроке»)
	Возврат Новый Структура("Успех, Описание, ДопОписание, Урок, УжеЕсть", Успех, Описание, ДопОписание, Урок, Ложь);
КонецФункции

#КонецОбласти

#КонецЕсли
